app/controllers/activities_controller.rb

  def show
    @activity = Activity.find(params[:id])
---
SELECT * FROM "activities" WHERE ("activities"."id" = 1)

  def edit
    @activity = Activity.find(params[:id])
---
SELECT * FROM "activities" WHERE ("activities"."id" = 1)

  def create
    @activity = Activity.new(params[:activity])

    respond_to do |format|
      if @activity.save
---
INSERT INTO "activities" ("name", "created_at", "uuid", "updated_at", "owner_id", "xhtml") VALUES(NULL, '2009-03-11 20:35:12', '1f1f9012-0e7c-11de-af8e-0023df83af94', '2009-03-11 20:35:12', NULL, NULL)

  def update
    @activity = Activity.find(params[:id])

    respond_to do |format|
      if @activity.update_attributes(params[:activity])
---
SELECT * FROM "activities" WHERE ("activities"."id" = 1)
UPDATE "activities" SET "updated_at" = '2009-03-11 20:36:38', "name" = 'This is the activity' WHERE "id" = 1