app/controllers/owners_controller.rb

SELECT * FROM "owners" WHERE ("owners"."id" = 1)
---
  def show
    @owner = Owner.find(params[:id])

SELECT * FROM "owners" WHERE ("owners"."id" = 1)
---
  def edit
    @owner = Owner.find(params[:id])

INSERT INTO "owners" ("created_at", "uuid", "updated_at", "last_name", "first_name") VALUES('2009-03-11 20:22:58', '696f18e2-0e7a-11de-9906-0023df83af94', '2009-03-11 20:22:58', NULL, NULL)
---
  def create
    @owner = Owner.new(params[:owner])

    respond_to do |format|
      if @owner.save

SELECT * FROM "owners" WHERE ("owners"."id" = 1)
UPDATE "owners" SET "updated_at" = '2009-03-11 20:26:26', "last_name" = 'Paessel', "first_name" = 'Noah' WHERE "id" = 1
---
  def update
    @owner = Owner.find(params[:id])

    respond_to do |format|
      if @owner.update_attributes(params[:owner])